Public Attributes | List of all members
API_OpeningReferenceAxisParameters Struct Reference
Element Manager
Opening floor plan and section reference axis parameters. More...
#include <APIdefs_Elements.h>
 Public Attributes
 bool  | showReferenceAxis
Show reference axis.
 short  | referenceAxisPenIndex
Reference axis pen index.
 API_AttributeIndex  | referenceAxisLineTypeIndex
Reference axis line type.
 double  | referenceAxisOverhang
Reference axis overhang.
Detailed Description
Opening floor plan and section reference axis parameters.